#1) გაუშვით ეს კოდი, ნახეთ რა არის ერორი, გამოასწორეთ გატესტეთ და საბოლოო
#გამოსწორებული ვერსია გამომიგზავნეთ დისქორდში

name = "data"
surname = "diasamidze"
age = 100

print("My name is" + " " + name + "my surname is" + " " + surname + "my age is" + " " + f"{age}")

#2) შექმენით 2 ცვლადი, გაზარდეთ პირველის მნიშვნელობა ერთით (reassign'ის გამოყენებით)
# და გამოიტანეთ ტერმინალში 

a = 2
b = 3
a+=1
print(a)

#3)კომენტარის სახით, თქვენი სიტყვებით ახსენით რა არის მნიშვნელობის გადაწერა


#მნიშვნელობის გადაწერა არის როცა უკვე გამოცხადებულ ცვლადს მინიჭებულ მნიშვნელობას ვუცვლით.



# 4)შექმენით ორი ცვლადი, balance და discount, ასევე შექმენით კიდევ ერთი ცვლადი სადაც
#იქნება საბოლოო ფასი და გამოიტანეთ ტერმინალში

balance = 140;
discount = 14; 

print(balance - discount)


